{
  "meta": {
    "theme": "professional"
  },
  "basics": {
    "name": "Eugene Blokhin",
    "label": "Tech Lead | Engineering Leadership | Scalable Systems | AI/ML Explorer",
    "email": "eugene.blokhin@gmail.com",
    "url": "https://eugene-blokhin.com",
    "summary": "Tech Lead with 13+ years of experience building scalable backend systems and leading cross-functional teams. Proven track record in driving architecture decisions, improving delivery processes, and mentoring engineers. I lead with a focus on ownership, trust, and continuous improvement—creating environments where teams deliver reliably and grow professionally.",
    "location": {
      "city": "Amsterdam, NL | Remote | Open to relocation"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "eugene-blokhin",
        "url": "https://github.com/eugene-blokhin"
      },
      {
        "network": "LinkedIn",
        "username": "eblokhin",
        "url": "https://www.linkedin.com/in/eblokhin/"
      }
    ]
  },
  "work": [
    {
      "company": "Firely",
      "position": "Tech Lead (joined as Senior Software Engineer)",
      "website": "https://fire.ly/",
      "startDate": "2021-06-01",
      "endDate": "2025-09-30",
      "summary": "I am a tech lead and senior software engineer at Firely where I work on the Firely Server, a FHIR server that is used by healthcare organizations worldwide. My role involves leading a team of developers, planning, designing and implementing new features, and ensuring the quality and performance of our software.",
      "highlights": [
        "Tech stack: FHIR, ASP.NET Core, SQL Server, MongoDB, Docker, Azure Dev Ops, Kubernetes, OpenTelemetry, OpenID Connect",
        "Spearheaded a major database performance initiative, introducing AST-based query optimizations that improved speed by up to 1000x for key clients, resolving critical bottlenecks with 4x less engineering effort than originally estimated",
        "Designed and implemented a zero-downtime database migration strategy, enabling seamless updates without service interruptions",
        "Implemented AI-driven release documentation automation, enabling the Consultant Team to better understand technical changes and streamline client migrations",
        "Led a team-wide process overhaul focused on predictability and transparency, reducing feature delivery time and minimizing surprises across QA, PO, developers, and external stakeholders",
        "Led and designed architecture during a consultancy project where we developed an ETL pipeline to migrate data from a proprietary database to Firely Server for one of our large clients",
        "Initiated regular knowledge-sharing sessions that improved technical depth, fostered team cohesion, and built a stronger remote-first engineering culture"
      ]
    },
    {
      "company": "Effectory",
      "position": "Senior Software Developer",
      "website": "http://effectory.com",
      "startDate": "2019-10-01",
      "endDate": "2021-05-31",
      "summary": "Helped the company with its transition to a cloud-based SaaS model by designing and building new features.",
      "highlights": [
        "Tech stack: C#/.NET, Azure Storage/Functions/App Services/Service Bus/ARM templates",
        "Designed and created a backup solution for our event-sourcing system log stored in Azure Tables (> 2.5 TB of data)"
      ]
    },
    {
      "company": "Chama Technologies",
      "position": "Software Developer",
      "website": "http://chamatheapp.com",
      "startDate": "2017-05-01",
      "endDate": "2019-09-15",
      "summary": "Helped the Uber-like startup for gas delivery in Brazil to scale on the technical side, gradually replacing MVP monolith with more reliable and maintainable microservices architecture and implementing new features as the business grew.",
      "highlights": [
        "Tech stack: C#/.NET, NServiceBus, Azure Storage/App Services/ServiceFabric/Service Bus...",
        "Pioneered rewriting our initially synchronous order flow to use an asynchronous messaging architecture. It opened up a way to extend functionality and dramatically increased reliability. It still facilitates the processing of ~200k orders per day",
        "Engineered a custom Azure Table Storage serialization layer, achieving 20x speed improvement over Microsoft’s default implementation",
        "Implemented and maintained a service to calculate and render invoices for our clients"
      ]
    },
    {
      "company": "Albelli",
      "position": "Software Engineer",
      "website": "http://albelli.nl",
      "startDate": "2014-12-01",
      "endDate": "2017-04-30",
      "summary": "Built and maintained software powering photo-products production facilities in The Netherlands and India",
      "highlights": [
        "Tech stack: C#/.NET, ASP.NET, SQL Server, RabbitMQ",
        "Modernized a service to deliver more than 3.5 TB of user's photos daily from the cloud to our print factory. It allowed decommissioning several obsolete services, therefore, improved reliability and maintainability",
        "Implemented a set of SQL static analysis tools to help us keep our database schema under control",
        "Gathered requirements and analyzed workflows in one of the factory production stages. Then, developed a monitoring system to help distribute the workforce more evenly to achieve maximum throughput for that stage"
      ]
    },
    {
      "company": "VIAcode",
      "position": "Software Developer",
      "website": "http://viacode.com",
      "startDate": "2012-11-01",
      "endDate": "2014-11-13",
      "summary": "Helped build new features for a SaaS solution for legal matter management (a Wolters Kluwer product) used by numerous large law firms in the US",
      "highlights": [
        "Tech stack: C#/.NET, ASP.NET WebApi, SQL Server, SoapUI",
        "Took ownership of performance testing and optimizations for our new RESTful service",
        "Wrote my master's thesis based on this project"
      ]
    },
    {
      "company": "Studio Mobile",
      "position": "Junior Software Developer",
      "website": "http://studiomobile.ru",
      "startDate": "2011-09-01",
      "endDate": "2012-10-31",
      "summary": "Helped develop and maintain a game using Unity3D",
      "highlights": [
        "Tech stack: C#/.NET, Unity3D, DirectDraw"
      ]
    }
  ],
  "education": [
    {
      "institution": "University Of Information Technologies, Mechanics and Optics (ITMO) - Russia, St. Petersburg",
      "area": "Software Development / Information Systems",
      "studyType": "Master",
      "startDate": "2009-09-01",
      "endDate": "2014-06-01"
    }
  ],
  "certificates": [{
      "name": "Machine Learning Specialization",
      "date": "2023-02-20",
      "issuer": "DeepLearning.AI, Stanford University",
      "url": "https://www.coursera.org/account/accomplishments/specialization/QL5MWP2B4PNX"
  }],
  "skills": [
    {
      "name": "Programming Languages / Frameworks",
      "keywords": [
        "C# (ASP.NET Core, EF)",
        "Python",
        "JavaScript / TypeScript / Node.js (+ React and Vue)",
        "C"
      ]
    },
    {
      "name": "Architecture",
      "keywords": [
        "Data: SQL Server, PostgreSQL, MongoDB, Azure Storage, Neo4j",
        "Messaging: RabbitMQ, Kafka",
        "Cache: Redis",
        "Standards: OAuth 2.0, OpenID Connect"
      ]
    },
    {
      "name": "DevOps / CI/CD / Cloud",
      "keywords": [
        "Azure (Service Bus, Functions, App Services, Storage, ARM/bicep templates)",
        "Docker",
        "Kubernetes",
        "Azure DevOps",
        "GitHub Actions",
        "GitOps (ArgoCD)",
        "OpenTelemetry"
      ]
    },
    {
      "name": "AI / Machine Learning",
      "keywords": [
        "ML Fundamentals (Gradient Descent, Backpropagation, Transformers)",
        "TensorFlow",
        "CrewAI",
        "LangFlow",
        "Prompt Engineering",
        "Vector Databases",
        "MCP Server Deployment"
      ]
    },
    {
      "name": "Soft Skills",
      "keywords": [
        "Tech Leadership",
        "Conflict Resolution",
        "Tech Mentoring",
        "Cross-team Collaboration",
        "Agile Methodologies (Scrum, Kanban)"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Dutch",
      "fluency": "Beginner"
    },
    {
      "language": "Russian",
      "fluency": "Native"
    }
  ],
  "projects":[
    {
      "name": "Freelance marketplace MVP for Czech market",
      "startDate": "2024-02-01",
      "endDate": "2025-03-20",
      "description": "Led the end-to-end development of a freelance marketplace for the Czech market. Owned the full technical stack and delivery process, transforming business requirements into a production-ready MVP with a clean, scalable architecture.",
      "highlights": [
        "Tech leadership: Owned architecture and technology selection across backend, frontend, deployment, and external integrations",
        "Requirements to architecture: Analyzed business needs and decomposed them into a system design optimized for maintainability and future growth",
        "Backend: Developed with .NET, PostgreSQL, and MassTransit for scalable async processing",
        "Frontend: guided a frontend engineer in building a responsive web app using Nuxt.js",
        "Deployment: Set up automated CI/CD with Argo CD and Kubernetes, managing multiple environments via GitOps",
        "Integration: Added analytics and operations tooling, including Meta Pixel, cookie consent, telemetry, and SendGrid for error alerts",
        "AI exploration: Prototyped an AI agent to enhance user interaction and explore future capabilities"
      ]
    },
    {
      "name": "AI-Powered Telegram bot for matching freelancers and clients",
      "url": "https://github.com/eugene-blokhin/p2p-job-bot-backend",
      "startDate": "2024-11-15",
      "endDate": "2025-02-15",
      "description": "A Telegram bot that automatically matches freelancers and clients based on the semantic meaning of their services/requests. It uses a fine-tuned model to understand the meaning of the text and match it with the most relevant services/requests. The bot is in C# with Postgres as a database. The bot has been deployed, but later I took it down due to difficulties attracting users.",
      "highlights": [
        "Tech Stack: C#, ASP.NET Core, PostgreSQL, Entity Framework, OpenAI API, HuggingFace Transformers, Docker, ArgoCD, Kubernetes"
      ]
    },
    {
      "name": "LSTM-based stock price prediction",
      "url": "https://github.com/eugene-blokhin/ai-financial-analysis",
      "startDate": "2023-06-01",
      "endDate": "2023-06-10",
      "description": "A Python-based project that uses a LSTM neural network to predict stock prices",
      "highlights": [
        "Tech Stack: Python, TensorFlow, Pandas, NumPy, Matplotlib"
      ]
    },
    {
      "name": "Implementing a 3D scanner control software (freelance)",
      "url": "https://designhubz.com",
      "startDate": "2020-06-01",
      "endDate": "2021-04-30",
     "description": "Led the development of controlling software for a hardware 3D scanner used in an AR/VR marketplace. Re-architected the entire solution to improve maintainability and system reliability.",
     "highlights": [
        "Tech stack: ASP.NET Core (Blazor), C++, Linux, Raspberry Pi, Arduino",
        "Re-architected and rewrote the original solution, dramatically improving code maintainability and system reliability",
        "The high-level part is an ASP.NET Core Blazor-based web application running on Raspberry Pi (Linux)",
        "Low-level control implemented in C++, running on ATMega328P microcontrollers"
      ]
    }
  ]
}
